Pandas is a popular Python package for data manipulation. It is build on the top of Numpy. The main data structures `Series` and `DataFrames`.

`Series` is a one-dimensional labeled array capable of holding data of any type. The axis labels are similar to keys in a dictionary and are collectively called index.

In [4]:
import pandas as pd
labels=['Moscow','London', 'Paris']
population=[11.5,8.6,2.2]
pd.Series(population)

0    11.5
1     8.6
2     2.2
dtype: float64

In [11]:
pd.Series(data=population)

0    11.5
1     8.6
2     2.2
dtype: float64

In [9]:
pd.Series(population,labels)

Moscow    11.5
London     8.6
Paris      2.2
dtype: float64

In [14]:
cities=pd.Series(data=population,index=labels)
cities

Moscow    11.5
London     8.6
Paris      2.2
dtype: float64

Data can be of any type

In [13]:
pd.Series(['cat',3.1,True,[2,3]])

0       cat
1       3.1
2      True
3    [2, 3]
dtype: object

Elements of `Series` are accessed similar the case of dictionaries:

In [16]:
cities['Moscow']

11.5

Operations with series are based on the index position

In [21]:
city_growth=pd.Series(data=[2.1,1.0,0.5,0.7],index=['Moscow','London', 'Paris', 'Berlin'])
cities+city_growth

Berlin     NaN
London     9.6
Moscow    13.6
Paris      2.7
dtype: float64

In [22]:
# NaN: not a number

`DataFrame` is a two-dimensional data structure with labeled axes (rows and columns).

### (by Jose Portilla)

In [25]:
import numpy as np
matrix=np.random.randn(5,4)

In [26]:
pd.DataFrame(matrix)

          0         1         2         3
0 -0.300224 -0.211785  0.306877  0.983019
1 -0.700967  0.733408  0.280066  1.780185
2  0.218878  1.668326  0.940951 -0.595073
3 -1.957437  0.932833 -0.877098 -0.754657
4 -1.081382 -0.869336 -0.568432 -0.555021

In [31]:
df=pd.DataFrame(data=matrix,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073
D -1.957437  0.932833 -0.877098 -0.754657
E -1.081382 -0.869336 -0.568432 -0.555021

In [33]:
df['W']

A   -0.300224
B   -0.700967
C    0.218878
D   -1.957437
E   -1.081382
Name: W, dtype: float64

In [36]:
type(df['W'])

pandas.core.series.Series

In [38]:
col=['X','W',]
df[col]

          X         W
A -0.211785 -0.300224
B  0.733408 -0.700967
C  1.668326  0.218878
D  0.932833 -1.957437
E -0.869336 -1.081382

Creating a new column

In [58]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -0.300224 -0.211785  0.306877  0.983019  0.006653
B -0.700967  0.733408  0.280066  1.780185 -0.420902
C  0.218878  1.668326  0.940951 -0.595073  1.159829
D -1.957437  0.932833 -0.877098 -0.754657 -2.834536
E -1.081382 -0.869336 -0.568432 -0.555021 -1.649814

Removing a column

In [60]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073
D -1.957437  0.932833 -0.877098 -0.754657
E -1.081382 -0.869336 -0.568432 -0.555021

In [64]:
# Not inplace unless specified!
df

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073
D -1.957437  0.932833 -0.877098 -0.754657
E -1.081382 -0.869336 -0.568432 -0.555021

In [62]:
df.drop('new',axis=1,inplace=True)

In [63]:
df

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073
D -1.957437  0.932833 -0.877098 -0.754657
E -1.081382 -0.869336 -0.568432 -0.555021

Selecting Rows

In [67]:
df.loc['A']

W   -0.300224
X   -0.211785
Y    0.306877
Z    0.983019
Name: A, dtype: float64

In [69]:
# or by index location
df.iloc[0]

W   -0.300224
X   -0.211785
Y    0.306877
Z    0.983019
Name: A, dtype: float64

In [70]:
df.iloc[[0,3]]

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
D -1.957437  0.932833 -0.877098 -0.754657

Selecting subset of rows and columns

In [71]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.300224  0.306877
B -0.700967  0.280066

Conditional Selection

In [72]:
df>0

       W      X      Y      Z
A  False  False   True   True
B  False   True   True   True
C   True   True   True  False
D  False   True  False  False
E  False  False  False  False

In [74]:
# Use it a conditional filter
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.306877  0.983019
B       NaN  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951       NaN
D       NaN  0.932833       NaN       NaN
E       NaN       NaN       NaN       NaN

In [80]:
df['W']>0

A    False
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [76]:
df[df['W']>0]

          W         X         Y         Z
C  0.218878  1.668326  0.940951 -0.595073

For two conditions you can use | (or) and & (and) with parenthesis:

In [79]:
df[(df['X']>0) & (df['Y'] > 0.1)]

          W         X         Y         Z
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073

Reset to default 0,1...n index. The former index becomes a column with name `index`.

In [85]:
# not inplace
df.reset_index()

  index         W         X         Y         Z
0     A -0.300224 -0.211785  0.306877  0.983019
1     B -0.700967  0.733408  0.280066  1.780185
2     C  0.218878  1.668326  0.940951 -0.595073
3     D -1.957437  0.932833 -0.877098 -0.754657
4     E -1.081382 -0.869336 -0.568432 -0.555021

In [86]:
df

          W         X         Y         Z
A -0.300224 -0.211785  0.306877  0.983019
B -0.700967  0.733408  0.280066  1.780185
C  0.218878  1.668326  0.940951 -0.595073
D -1.957437  0.932833 -0.877098 -0.754657
E -1.081382 -0.869336 -0.568432 -0.555021

Let us introduce a new column and transform it to index.

In [96]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

               W         X         Y         Z States
States
CA     -0.300224 -0.211785  0.306877  0.983019     CA
NY     -0.700967  0.733408  0.280066  1.780185     NY
WY      0.218878  1.668326  0.940951 -0.595073     WY
OR     -1.957437  0.932833 -0.877098 -0.754657     OR
CO     -1.081382 -0.869336 -0.568432 -0.555021     CO

In [97]:
# not inplace
df.set_index('States')

               W         X         Y         Z
States
CA     -0.300224 -0.211785  0.306877  0.983019
NY     -0.700967  0.733408  0.280066  1.780185
WY      0.218878  1.668326  0.940951 -0.595073
OR     -1.957437  0.932833 -0.877098 -0.754657
CO     -1.081382 -0.869336 -0.568432 -0.555021

In [98]:
df

               W         X         Y         Z States
States
CA     -0.300224 -0.211785  0.306877  0.983019     CA
NY     -0.700967  0.733408  0.280066  1.780185     NY
WY      0.218878  1.668326  0.940951 -0.595073     WY
OR     -1.957437  0.932833 -0.877098 -0.754657     OR
CO     -1.081382 -0.869336 -0.568432 -0.555021     CO

In [99]:
# not inplace
df.set_index('States',inplace=True)
df

               W         X         Y         Z
States
CA     -0.300224 -0.211785  0.306877  0.983019
NY     -0.700967  0.733408  0.280066  1.780185
WY      0.218878  1.668326  0.940951 -0.595073
OR     -1.957437  0.932833 -0.877098 -0.754657
CO     -1.081382 -0.869336 -0.568432 -0.555021

Summary statistics on all numerical columns

In [102]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.764226  0.450689  0.016473  0.171691
std    0.823124  0.997042  0.732983  1.142329
min   -1.957437 -0.869336 -0.877098 -0.754657
25%   -1.081382 -0.211785 -0.568432 -0.595073
50%   -0.700967  0.733408  0.280066 -0.555021
75%   -0.300224  0.932833  0.306877  0.983019
max    0.218878  1.668326  0.940951  1.780185

How many positive values in a column

In [103]:
df['W']>0

States
CA    False
NY    False
WY     True
OR    False
CO    False
Name: W, dtype: bool

In [106]:
ser_w=df['W']>0

In [107]:
ser_w.value_counts()

False    4
True     1
Name: W, dtype: int64

Another method

In [110]:
# Number of true values. True corresponds to 1, and False corresponds to 0. 
ser_w.sum()

1

In [111]:
len(ser_w)

5

### Groupby
The groupby method allows you to group rows of data together and call aggregate functions

In [113]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [114]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [115]:
by_comp = df.groupby("Company")

In [116]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [117]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [118]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Operations

In [17]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Info on Unique Values

In [18]:
# unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [19]:
# number of unique values
df['col2'].nunique()

3

In [20]:
# number of each unique value
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [21]:
# Col1>Col2
# Col2==444 
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

Applying Functions

In [22]:
def times2(x):
    return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df['new']=df['col1'].apply(times2)
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [24]:
df['col1'].sum()

10

Deleting a column

In [25]:
del df['col1']
df

   col2 col3  new
0   444  abc    2
1   555  def    4
2   666  ghi    6
3   444  xyz    8

In [26]:
df.drop(labels=1,axis=0)

   col2 col3  new
0   444  abc    2
2   666  ghi    6
3   444  xyz    8

In [27]:
df.drop(labels='col2',axis=1)

  col3  new
0  abc    2
1  def    4
2  ghi    6
3  xyz    8

In [30]:
df

   col2 col3  new
0   444  abc    2
1   555  def    4
2   666  ghi    6
3   444  xyz    8

Get column and index names

In [28]:
df.columns

Index(['col2', 'col3', 'new'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col2    4 non-null int64
col3    4 non-null object
new     4 non-null int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

 Sorting

In [32]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3  new
0   444  abc    2
3   444  xyz    8
1   555  def    4
2   666  ghi    6

### Data Input and Output

For more information search for "Pandas IO"

In [1]:
import numpy as np
import pandas as pd

### CSV
Comma Separated Values files are text files that use commas as field delimeters.
<br> You may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br> In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl

Then restart Jupyter Notebook.

CSV Input

In [2]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

CSV Output

In [6]:
newdf=df[['a','b']]
newdf.to_csv('new_example.csv',index=False)

In [8]:
# index is 0,1,2,... by default
pd.read_csv('new_example.csv')

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

### Excel
Pandas can read and write MS Excel files. However, this only imports data, not formulas or images. A file that contains images or macros may cause the <tt>.read_excel()</tt>method to crash.

In [10]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [12]:
# Unnamed correspond to index.
df=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [14]:
df.drop('Unnamed: 0',axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### HTML
Pandas can read table tabs off of HTML.<br>
You may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install beautifulsoup4

### HTML Input
Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [21]:
# Failed Bank List
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [17]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [22]:
type(df)

list

In [23]:
len(df)

1